Repository: StanfordSpezi/SpeziAccount
Catalog: Sources/SpeziAccount/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, sv

# ACCOUNT_ERROR_ACCOUNT_ID_CHANGED_DESCRIPTION
source: Failed Account Operation
de: Anfrage Fehlgeschlagen
es: Operación de cuenta fallida
sv: Kontoåtgärd misslyckades

# ACCOUNT_ERROR_ACCOUNT_ID_CHANGED_REASON
source: You primary account identifier cannot be changed as it is required to be stable!
de: Deine primäre Benutzerkennung kann nicht geändert werden da diese dauerhaft vergeben wird!
es: ¡Tu identificador principal de cuenta no puede ser cambiado!
sv: Din primära kontoidentifierare kan inte ändras eftersom den måste vara stabil!

# ACCOUNT_ERROR_RECOVERY
source: Raise an issue with the developer of the Account Service.
de: Melde dieses Problem dem Entwickler des Account Services.
es: Exponer cualquier problema con el representante del servicio de cuentas.
sv: Rapportera ett problem till utvecklaren av kontotjänsten.

# ACCOUNT_ERROR_VALUES_MISSING_VALUE_DESCRIPTION
source: Missing Account Values
de: Fehlende Werte im Benutzerkonto
es: Falta información en la cuenta
sv: Kontouppgifter saknas

# ACCOUNT_ERROR_VALUES_MISSING_VALUE_REASON %@
source: The following required account values were not supplied: %@.
de: Die folgenden Werte wurden nicht im Benutzerkonto gesetzt: %@.
es: No se proporciono la siguiente información requerida para la cuenta: %@.
sv: Följande obligatoriska kontouppgifter angavs inte: %@.

# ACCOUNT_HEADER_CAPTION
source: Account Information & Details
de: Kontoinformationen & Details
es: Información y Detalles de la Cuenta
sv: Kontoinformation & detaljer

# ACCOUNT_ID
source: Account Identifier
de: Benutzerkennung
es: Identificador de Cuenta
sv: Kontoidentifierare

source: Account Overview
de: Benutzerkonto
es: Resumen de la Cuenta
sv: Kontoöversikt

# ACCOUNT_OVERVIEW_EDIT_DEFAULT_ERROR
source: Could not save account details!
de: Speichern deiner Änderung fehlgeschlagen!
es: ¡No se pudieron guardar los detalles de la cuenta!
sv: Kunde inte spara kontoinformationen!

# ACCOUNT_WELCOME
source: Your Account
de: Dein Benutzerkonto
es: Tu Cuenta
sv: Ditt Konto

# ACCOUNT_WELCOME_SIGNED_IN_SUBTITLE
source: You are already logged in with the account shown below. Continue or change your account by logging out.
de: Du bist bereits mit dem folgenden Benutzerkonto angemeldet. Du kannst dein Benutzerkonto ändern, indem du dich abmeldest.
es: Ya has iniciado una sesión con la cuenta que se muestra abajo. Continúa o cambia tu cuenta cerrando la sesión.
sv: Du är redan inloggad med kontot som visas nedan. Fortsätt eller byt konto genom att logga ut.

# ACCOUNT_WELCOME_SUBTITLE
source: Please login to your account. Or create a new one if you don't have one already.
de: Melde dich mit deinem Benutzerkonto an oder erstelle ein neues, wenn du noch keins hast.
es: Por favor inicia sesión en tu cuenta. O crea una nueva si aún no tienes una.
sv: Logga in på ditt konto. Eller skapa ett nytt om du inte redan har ett.

source: Add Date
de: Datum hinzufügen
es: Añadir fecha
sv: Lägg till datum

source: Add Date of Birth
de: Geburtsdatum hinzufügen
es: Añadir fecha de nacimiento
sv: Lägg till födelsedatum

source: Already got an Account?
de: Du hast bereits ein Benutzerkonto?
es: ¿Ya tienes una cuenta?
sv: Har du redan ett konto?

source: Anonymous User
de: Anonymer Benutzer
es: Usuario anónimo
sv: Anonym användare

source: Cancel
de: Abbrechen
es: Cancelar
sv: Avbryt

source: Change Password
de: Passwort Ändern
es: Cambiar Contraseña
sv: Byt lösenord

source: Close
de: Schließen
es: Cerrar
sv: Stäng

# CONFIRMATION_DISCARD_ADDITIONAL_INFO_TITLE
source: This account information is required. If you abort, you will automatically be signed out!
de: Diese Kontoinformationen sind erfoderlich. Wenn du abbrichst, wirst du automatisch abgemeldet!
es: ¡Esta información de la cuenta es necesaria. Si abortas, se cerrará automáticamente tu sesión!
sv: Den här kontoinformationen krävs. Om du avbryter kommer du automatiskt att loggas ut!

# CONFIRMATION_DISCARD_CHANGES
source: Discard Changes
de: Änderungen Verwerfen
es: Descartar Cambios
sv: Förkasta ändringar

# CONFIRMATION_DISCARD_CHANGES_TITLE
source: Are you sure you want to discard your changes?
de: Willst du alle Änderungen verwerfen?
es: ¿Estás seguro de que deseas descartar tus cambios?
sv: Är du säker på att du vill förkasta dina ändringar?

# CONFIRMATION_DISCARD_INPUT
source: Discard Input
de: Eingaben Verwerfen
es: Descartar Información
sv: Förkasta inmatning

# CONFIRMATION_DISCARD_INPUT_TITLE
source: Are you sure you want to discard your input?
de: Willst du deine Eingaben verwerfen?
es: ¿Estás seguro de que deseas descartar tu información?
sv: Är du säker på att du vill förkasta din inmatning?

# CONFIRMATION_KEEP_EDITING
source: Keep Editing
de: Weiter Bearbeiten
es: Continuar Editando
sv: Fortsätt redigera

# CONFIRMATION_LOGOUT
source: Are you sure you want to logout?
de: Willst du dich wirklich abmelden?
es: ¿Estás seguro de que deseas cerrar sesión?
sv: Är du säker på att du vill logga ut?

# CONFIRMATION_REMOVAL
source: Are you sure you want to delete your account?
de: Willst du wirklich dein Benutzerkonto löschen?
es: ¿Estás seguro de que deseas eliminar tu cuenta?
sv: Är du säker på att du vill ta bort ditt konto?

# CONFIRMATION_REMOVAL_SUGGESTION
source: This change is permanent and you won't be able to recover your account information.
de: Dieser Vorgang is endgültig und du kannst dein Konto Informationen nicht wiederherstellen.
es: Este cambio es permanente y no podrás recuperar la información de tu cuenta.
sv: Denna ändring är permanent och du kommer inte att kunna återställa din kontoinformation.

source: Delete
de: Löschen
es: Eliminar
sv: Radera

source: Delete Account
de: Löschen
es: Eliminar Cuenta
sv: Radera konto

source: Done
de: Fertig
es: Listo
sv: Klart

source: Double Key
de: Doppelte Taste
es: Tecla doble
sv: Dubbel nyckel

source: Edit
de: Bearbeiten
es: Editar
sv: Redigera

# FOLLOW_UP_INFORMATION_COMPLETE
source: Complete
de: Fertig
es: Completar
sv: Slutför

# FOLLOW_UP_INFORMATION_INSTRUCTIONS
source: Please fill out the details below to complete your account setup.
de: Bitte fülle die folgenden Informationen aus, um dein Benutzerkonto zu vervollständigen.
es: Por favor, rellena los detalles a continuación para completar la configuración de tu cuenta.
sv: Fyll i uppgifterna nedan för att slutföra inställningen av ditt konto.

# FOLLOW_UP_INFORMATION_TITLE
source: Finish Account Setup
de: Account Vervollständigen
es: Finalizar Configuración de Cuenta
sv: Slutför kontoinställningar

# GENDER_IDENTITY_FEMALE
source: Female
de: Weiblich
es: Femenino
sv: Kvinna

# GENDER_IDENTITY_MALE
source: Male
de: Männlich
es: Masculino
sv: Man

# GENDER_IDENTITY_NON_BINARY
source: Non-binary
de: Nicht-binär
es: No Binario
sv: Ickebinär

# GENDER_IDENTITY_PREFER_NOT_TO_STATE
source: Choose not to answer
de: Keine Angabe
es: Prefiero no responder
sv: Väljer att inte svara

# GENDER_IDENTITY_TITLE
source: Gender Identity
de: Geschlechtsidentität
es: Identidad de Género
sv: Könsidentitet

source: Invalid Modification
de: Ungültige Änderungen
es: Modificación no válida
sv: Ogiltig ändring

# MISSING_ACCOUNT_DETAILS
source: This view requires an active user account. Refer to the documentation of the AccountSetup view on how to setup a user account!
de: **Kein Benutzerkonto gefunden.** Diese Oberfläche erfordert ein aktives Benutzerkonto. Bitte kontaktiere die Dokumentation für die AccountSetup Oberfläche, um ein Benutzerkonto einzurichten.
es: **No se pudo encontrar una cuenta de usuario.** Esta pagina require una cuenta de usuario activa. ¡Consulte la documentación de la pagina 'AccountSetup' sobre cómo configurar una nueva cuenta de usuario!
sv: Den här vyn kräver ett aktivt användarkonto. Se dokumentationen för AccountSetup-vyn för hur du skapar ett användarkonto!

# MISSING_ACCOUNT_SERVICES
source: Please refer to the documentation of the SpeziAccount package on how to set up an AccountService!
de: **Es wurden keine Account Services konfiguriert.** Bitte kontaktiere die Dokumentation von SpeziAccount für mehr Informationen zur Konfiguration eines AccountServices!
es: **No hay servicios de cuenta configurados.** ¡Por favor, consulte la documentación del paquete SpeziAccount sobre cómo configurar un servicio de cuenta!
sv: Se dokumentationen för SpeziAccount-paketet för hur du skapar en AccountService!

# NEW_PASSWORD
source: New
de: Neues
es: Nueva Contraseña
sv: Ny

# NEW_PASSWORD_PROMPT
source: enter password
de: Passwort eingeben
es: Entre contraseña
sv: ange lösenord

source: No
de: Nein
sv: Nej

source: No Account Service
de: Kein Account Service
es: Servicio de cuenta no disponible
sv: Ingen kontotjänst

source: No User Account
de: Kein Benutzerkonto
es: No hay cuenta de usuario
sv: Inget användarkonto

source: Numeric Key
de: Zifferntaste
es: Tecla numérica
sv: Numerisk Nyckel

source: Off
de: Aus
es: Desactivado
sv: Av

source: On
de: An
es: Activado
sv: På

source: Open Documentation
de: Dokumentation öffnen
es: Abrir Documentación
sv: Öppna dokumentation

source: or
de: oder
es: o
sv: eller

source: Please raise an issue with the App developer.
de: Melde dieses Problem dem App Entwickler.
es: Informe del problema al desarrollador de la aplicación.
sv: Rapportera problemet till apputvecklaren.

# REMOVE_DEFAULT_ERROR
source: Could not remove account!
de: Löschen fehlgeschlagen!
es: ¡No se pudo eliminar la cuenta!
sv: Det gick inte att ta bort kontot!

# REPEAT_PASSWORD
source: Verify
de: Bestätigen
es: Verificar contraseña
sv: Verifiera

# REPEAT_PASSWORD_PROMPT
source: re-enter password
de: Passwort wiederholen
es: Escriba la contraseña otra vez
sv: ange lösenord igen

# SIGN_IN_AND_SECURITY
source: Sign-In & Security
de: Anmeldung & Sicherheit
es: Inicio de Sesión y Seguridad
sv: Inloggning & säkerhet

source: The following account values are not mutable: %@.
de: Die Folgenden Werte können nicht bearbeitet werden: %@.
es: Los siguientes valores de la cuenta no se pueden modificar: %@.
sv: Följande kontovärden kan inte ändras: %@.

source: The input can only consist of digits.
de: Die Eingabe kann nur aus Zahlen bestehen.
es: La entrada solo puede contener dígitos.
sv: Inmatningen kan bara bestå av siffror.

source: The internal account identifier is meant to be generated!
de: Der interne Kontokenner soll generiert werden!
es: El identificador interno de la cuenta debe generarse.
sv: Det interna kontoidentifieraren är avsedd att genereras!

source: The internal account identifier is not meant to be user facing!
de: Der interne Kontokenner ist nicht dafür gedacht, dem Benutzer angezeigt zu werden!
es: El identificador interno de la cuenta no está destinado a ser visible para el usuario.
sv: Det interna kontoidentifieraren är inte avsedd att visas för användaren!

source: This field is required.
de: Dieses Feld is erforderlich.
es: Este campo es obligatorio.
sv: Detta fält är obligatoriskt.

source: Toggle
de: Schalter
es: Alternar
sv: Växla

# UAP_PASSWORD_RESET_SUBTITLE %@
source: Please enter your %@ of your Account. A password reset email will be sent to the linked email address.
de: Bitte geben Sie Ihre %@ für Ihr Konto ein. Eine E‑Mail zum Zurücksetzen des Passworts wird an die verknüpfte E‑Mail‑Adresse gesendet.
es: Por favor, escribe tu %@ de tu cuenta. Se enviará un correo electrónico para restablecer la contraseña a la dirección de correo electrónico vinculado.
sv: Ange din %@ för ditt konto. Ett e-postmeddelande för lösenordsåterställning kommer att skickas till den länkade e-postadressen.

# UAP_RESET_PASSWORD_FAILED_DEFAULT_ERROR
source: Could not reset the password!
de: Passwort Zurücksetzen fehlgeschlagen!
es: ¡No pude restablecer la contraseña!
sv: Det gick inte att återställa lösenordet!

# UAP_RESET_PASSWORD_PROCESS_SUCCESSFUL_LABEL
source: Sent out a link to reset the password.
de: Ein Link zum Zurücksetzen das Passworts wurde versandt.
es: Se ha enviado un enlace para restablecer la contraseña.
sv: Skickat en länk för lösenordsåterställning.

# UAP_SIGNUP_DATE_OF_BIRTH_TITLE
source: Date of Birth
de: Geburtsdatum
es: Fecha de Nacimiento
sv: Födelsedatum

# UAP_SIGNUP_FAMILY_NAME_PLACEHOLDER
source: enter last name
de: Nachnamen eingeben
es: escribir tu apellido
sv: ange efternamn

# UAP_SIGNUP_FAMILY_NAME_TITLE
source: Last
de: Nachname
es: Apellido
sv: Efternamn

# UAP_SIGNUP_GIVEN_NAME_PLACEHOLDER
source: enter first name
de: Vornamen eingeben
es: escribir tu nombre
sv: ange förnamn

# UAP_SIGNUP_GIVEN_NAME_TITLE
source: First
de: Vorname
es: Nombre
sv: Förnamn

# UP_CONTACT_DETAILS
source: Contact Details
de: Kontaktdaten
es: Detalles de Contacto
sv: Kontaktuppgifter

# UP_CREDENTIALS
source: Credentials
de: Zugangsdaten
es: Credenciales
sv: Autentiseringsuppgifter

# UP_FORGOT_PASSWORD
source: Forgot Password?
de: Password vergessen?
es: ¿Olvidaste tu contraseña?
sv: Glömt lösenord?

# UP_LOGIN
source: Login
de: Anmelden
es: Iniciar sesión
sv: Logga in

# UP_LOGIN_FAILED_DEFAULT_ERROR
source: Could not login!
de: Anmeldung fehlgeschlagen!
es: ¡No pude iniciar sesión!
sv: Det gick inte att logga in!

# UP_LOGOUT
source: Logout
de: Abmelden
es: Cerrar sesión
sv: Logga ut

# UP_LOGOUT_FAILED_DEFAULT_ERROR
source: Could not logout!
de: Anmeldung fehlgeschlagen!
es: ¡No se pudo cerrar la sesión!
sv: Det gick inte att logga ut!

# UP_NO_ACCOUNT_YET
source: Don't have an Account yet?
de: Du hast noch kein Benutzerkonto?
es: ¿Aún no tienes una cuenta?
sv: Har du inget konto ännu?

# UP_PASSWORD
source: Password
de: Passwort
es: Contraseña
sv: Lösenord

# UP_PERSONAL_DETAILS
source: Personal Details
de: Persönliche Details
es: Detalles Personales
sv: Personliga uppgifter

# UP_RESET_PASSWORD
source: Reset Password
de: Passwort Zurücksetzten
es: Restablecer Contraseña
sv: Återställ Lösenord

# UP_SIGNUP
source: Signup
de: Registrieren
es: Inscribirse
sv: Registrera dig

# UP_SIGNUP_FAILED_DEFAULT_ERROR
source: Could not sign up!
de: Registrierung fehlgeschlagen!
es: ¡No pude registrar!
sv: Det gick inte att registrera dig!

# UP_SIGNUP_HEADER
source: Create a new Account
de: Erstelle dein Benutzerkonto
es: Crear una nueva cuenta
sv: Skapa ett nytt konto

# UP_SIGNUP_INSTRUCTIONS
source: Please fill out the details below to create your new account.
de: Bitte fülle die folgenden Informationen aus, um ein neues Benutzerkonto zu erstellen.
es: Por favor, rellena los detalles a continuación para crear tu nueva cuenta.
sv: Fyll i uppgifterna nedan för att skapa ditt nya konto.

# USER_ID
source: User Identifier
de: Benutzername
es: Identificador de Usuario
sv: Användar-ID

# USER_ID_EMAIL
source: E-Mail Address
de: E-Mail Adresse
es: Dirección de Correo Electrónico
sv: E-postadress

# USER_ID_USERNAME
source: Username
de: Benutzername
es: Nombre de Usuario
sv: Användarnamn

# VALIDATION_RULE_ALWAYS_ACCEPT
source: This rule always accepts.
de: Diese Regel akzeptiert alle Eingaben.
es: Esta regla siempre acepta todas las entradas.
sv: Denna regel accepterar alltid.

# VALIDATION_RULE_PASSWORDS_NOT_MATCHED
source: Passwords do not match.
de: Die Passwörter stimmen nicht überein.
es: Las contraseñas no coinciden.
sv: Lösenorden matchar inte.

# VALUE_ADD %@
source: Add %@
de: %@ Hinzufügen
es: Agregar %@
sv: Lägg till %@

source: Yes
de: Ja
es: Sí
sv: Ja

# GENDER_IDENTITY_TRANSGENDER
source: Transgender
es: Transgénero
sv: Transperson

source: Name
es: Nombre
sv: Namn

# UP_NAME
source: Name
es: Nombre y Apellido
sv: Namn
